In [3]:
import pandas as pd

In [4]:
s2 = pd.Series([68, 83, 112, 68],index = ['alice',"bob", "charles", "darwin"],name = 'Age')
print(s2)

alice       68
bob         83
charles    112
darwin      68
Name: Age, dtype: int64

In [5]:
s3 = pd.Series([70,80,100,60], index = ['bob','darwin', 'Ram','Shyam'], name = 'weight')

In [6]:
df = pd.DataFrame([s2,s3])#, columns = [x.name for x in (s2,s3)], index = [x for x in])
df

        alice   bob  charles  darwin    Ram  Shyam
Age      68.0  83.0    112.0    68.0    NaN    NaN
weight    NaN  70.0      NaN    80.0  100.0   60.0

In [7]:
df_3 = pd.DataFrame({'weight':s3,'age':s2})
df_3

         weight    age
Ram       100.0    NaN
Shyam      60.0    NaN
alice       NaN   68.0
bob        70.0   83.0
charles     NaN  112.0
darwin     80.0   68.0

In [8]:
s4 = pd.Series([175,150,180], index = ['Ram','Shyam','Prince'],name = 'height')

In [9]:
df_3 = pd.concat([df_3,s4], axis = 1)
df_3

         weight    age  height
Ram       100.0    NaN   175.0
Shyam      60.0    NaN   150.0
alice       NaN   68.0     NaN
bob        70.0   83.0     NaN
charles     NaN  112.0     NaN
darwin     80.0   68.0     NaN
Prince      NaN    NaN   180.0

In [10]:
df_1 = pd.concat([s2,s3], axis = 1)
df_1

           Age  weight
alice     68.0     NaN
bob       83.0    70.0
charles  112.0     NaN
darwin    68.0    80.0
Ram        NaN   100.0
Shyam      NaN    60.0

In [25]:
df_3

         weight    age  height
Name
Ram       100.0    NaN   175.0
Shyam      60.0    NaN   150.0
alice       NaN   68.0     NaN
bob        70.0   83.0     NaN
charles     NaN  112.0     NaN
darwin     80.0   68.0     NaN
Prince      NaN    NaN   180.0

In [28]:
df_3.loc[['alice', 'charles'],['weight','height']] = (75,190),(85,200)

In [29]:
df_3

         weight    age  height
Name
Ram       100.0    NaN   175.0
Shyam      60.0    NaN   150.0
alice      75.0   68.0   190.0
bob        70.0   83.0     NaN
charles    85.0  112.0   200.0
darwin     80.0   68.0     NaN
Prince      NaN    NaN   180.0

In [24]:
df_3.index.name = 'Name'

In [26]:
df_3.loc[['Shyam', 'charles'],['weight', 'height']]

         weight  height
Name
Shyam      60.0   150.0
charles     NaN     NaN

In [27]:
df_3.iloc[[1,4],[0,2]]

         weight  height
Name
Shyam      60.0   150.0
charles     NaN     NaN

In [23]:
df_3.iloc[1:4,1:]

        age  height
Shyam   NaN   150.0
alice  68.0     NaN
bob    83.0     NaN

In [12]:
df_3.loc['alice','age']

68.0

In [13]:
df_3.iloc[2,1]

68.0

In [17]:
{x:y for x,y in enumerate(df_3.index)},{a:z for a,z in enumerate(df_3.columns)}

({0: 'Ram',
  1: 'Shyam',
  2: 'alice',
  3: 'bob',
  4: 'charles',
  5: 'darwin',
  6: 'Prince'},
 {0: 'weight', 1: 'age', 2: 'height'})